#+TITLE: WoRkshop
#+DATE: <2020-06-19 Fri>
#+AUTHOR: Daniel Ballesteros-Chávez & Miguel López-Cruz
#+EMAIL: danielyho@yahoo.com
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:t p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:nil toc:t todo:t |:t
#+CREATOR: Emacs 24.5.1 (Org mode 8.2.10)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:nil
#+OPTIONS: html5-fancy:nil tex:t
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)
#+HTML_CONTAINER: div
#+HTML_DOCTYPE: xhtml-strict
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+INFOJS_OPT:
#+LATEX_HEADER:

# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gitcdn.link/repo/ennaniux/R_Surveys/master/style01.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style01.css"/>

# - Daniel Ballesteros-Chávez                                                            danielyho@yahoo.com
# - Duane West - Statistician, Special Projects Unit, Surveys Division                   dwest@statinja.gov.jm
# - Ieesha Graham - Senior Statistician, Special Projects Unit, Surveys Division         igmcintosh@statinja.gov.jm
# - Philone Mantock -  Unit Head, Special Projects Unit, Surveys Division                pmantock@statinja.gov.jm
# - Natalee Simpson - Director, Surveys Division                                         nsimpson@statinja.gov.jm
# - Amanda Lee - Statistician, Research, Design and Evaluation Division                  alee@statinja.gov.jm
# - Alicia Moncrieffe - Statistician, Research, Design and Evaluation Division           amoncrieffe@statinja.gov.jm

#+BEGIN_SRC emacs-lisp :exports none
* The working directory.

One of the first things we should get comfortable with is 
specifying the directory were the program is supposed to 
apply all the instructions and commands wear are providing.

The command =getwd()= will print the path where
the current R session is reading the files from:

#+BEGIN_SRC R :results output :exports both :eval yes
getwd()
#+END_SRC

#+RESULTS:
: [1] "/home/daniel/Documents/org/norgtes/nDataAnalysis/WoRkshop"


To change the working directory then we should use the command
=setwd()= and provide the full path of the directory we want to
work from

#+BEGIN_SRC R :results output :exports both :eval yes
setwd("/home/daniel/Documents/org/norgtes/nDataAnalysis/WoRkshop")
#+END_SRC

#+RESULTS:

Once we have set our working directory, we can explore other features of R.

We can start using R as calculator by typing directly into the command line

#+BEGIN_SRC R :results output :exports both :eval yes
4 * 3/ 2
#+END_SRC

#+RESULTS:
: [1] 6


#+BEGIN_SRC R :results output :exports both :eval yes
print(3*3*3)
#+END_SRC


One should create and save a file into the working directory as =file_name.R=. This is a text file with commands
that R takes and process. It is usually referred as /the script/ and we would like to re-use it and improve it. Later we can write =source("file_name.R")=
into the command line and run all the instructions contained in the script. In general, one can also run a script from a different working directory by typing the following command in the
R console

#+BEGIN_SRC 
source("path/file_name.R")
#+END_SRC


*Note*: In case you are using a Windows system, whenever a file or directory path appears, one should change the =/= by one of the characters =\= or =//=.

* Reading a data set from a file.

Inside the =WoRkshop/Datasets/= directory we have a data stored in the file =TPer_Vic1.dbf=.
In order to read this data set file we use the command =read.dbf=
and we give the  path to the file. Also we will store it
into the "Object" df as follows

#+BEGIN_SRC R :results output :exports both :session
df <- read.dbf("Datasets/TPer_Vic1.dbf")
#+END_SRC

#+RESULTS[1062a5321f9b5d8ee3ae65ceaf7800840b738be9]:

Now we are able to ask R details about our objects, for instance, we can
get know the type of object it is

#+BEGIN_SRC R :results output :exports both :session
class(df)
#+END_SRC

Now that we know that the object =df= is a data frame, we can
get information about its dimension

#+BEGIN_SRC R :results output :exports both :session
dim(df)
#+END_SRC
here, the number of rows and number of columns are shown.

We have created an object called =df=, and we can ask and keep
track of the objects we are creating in the session with the command
=ls()=, this will show a list of all the objects we have created in the current session

#+BEGIN_SRC R :results output :exports both :session
ls()
#+END_SRC


Many R objects have a ‘class’ attribute, in many cases it is implicit and given by
one of "matrix"’, ‘"array", "integer", "functions", etc.
In order to know this attribute we use the function =class=.


We can create numeric vectors 
#+BEGIN_SRC R :results output :exports both :session
V  <-  c(3,4,4,5,6)
W  <-  c(4,4,1,2,3)
#+END_SRC
and we can ask for their class, 

#+BEGIN_SRC R :results output :exports both :session
class(V) 
#+END_SRC

We can also compute the sum $V + W$

#+BEGIN_SRC R :results output :exports both :session
V + W
#+END_SRC


At this point it is important to understand how the missing values are managed 
when we are performing an  arithmetic operation. Let
#+BEGIN_SRC R :results output :exports both :session
X  <- c( NA, 1,2,3,4)
#+END_SRC


Then the sum with missing values
#+BEGIN_SRC R :results output :exports both :session
X + V
#+END_SRC
gives a missing value in the first entry.

Coming back to df, this is a data frame containing the information
gathered from a questionnaire of the National Victimisation Survey 
in Mexico. The name of the columns can be shown as follows:

#+BEGIN_SRC R :results output :exports both :session
names(df)
#+END_SRC

We can also do subsets of the data set in the following way
#+BEGIN_SRC R :results output :exports both :session
df[c(1,2,3),c(1,2,3,4)]
#+END_SRC

To select one column we use the dollar sign =$= after the data frame.
We will select the variable "FAC\under{}ELE" which, in this example,
is the variable of the weight for each interview according to the
sampling design

#+BEGIN_SRC R :results output :exports code :session
df$FAC_ELE
#+END_SRC


When we do class(df$FAC\under{}ELE) one can see
#+BEGIN_SRC R :results output :exports both :session
class(df$FAC_ELE) 
#+END_SRC
here we are selecting the variable
FAC\under{}ELE from the data frame =df= and asking the type of variable it is.
In this case it is a factor type (which is similar to character).
We will transform this into a numeric vector:
first we create a new variable for df from an existing
one, we change the factor type to character and finally to a numeric one.

#+BEGIN_SRC R :results output :exports both :session
df$NEWVAR  <-  as.numeric(as.character(df$FAC_ELE))
#+END_SRC

#+BEGIN_SRC R :results output :exports both :session
class(df$NEWVAR)
sum(df$NEWVAR)
#+END_SRC


Now we show a list of all the the objects we have created,
and then we remove them all

#+BEGIN_SRC R :results output :exports both :session
ls()
rm(list=ls())
ls()
#+END_SRC

If we are working in our file =file_name.R= we can copy and paste
the lines to read the dbf file again and store it into the object df, create the variable NEWVAR
and keep editing the file without loosing the work done previously.

#+BEGIN_SRC R :results output :exports both :session
df <- read.dbf("Datasets/TPer_Vic1.dbf")
df$NEWVAR  <-  as.numeric(as.character(df$FAC_ELE))
#+END_SRC

We can select two more variable and get the
frequency table for each of them

#+BEGIN_SRC R :results output :exports both :session
table(df$NOM_ENT)
table(df$AP4_3_3)
#+END_SRC

We can use NEWVAR to create a weighted form of the previous table by using the function tapply.
#+BEGIN_SRC R :results output :exports both :session
tapply(df$NEWVAR,df$AP4_3_3,sum)
#+END_SRC

The family apply is a very popular and powerful collection of tools that
substitute the usual =for= loop in programming. 

We can also add another variable in this function
say, the name of the provinces
#+BEGIN_SRC R :results output :exports both :session
tapply(df$NEWVAR,list(df$NOM_ENT,df$AP4_3_3),sum)
#+END_SRC

#+RESULTS:
: Error in df$NOM_ENT : object of type 'closure' is not subsettable

** Row and column binding

Now we will do some basic operations with two data frames,
first define:

#+BEGIN_SRC R :results output :exports both :session
df3  <-  data.frame("Names"=c("John"),
                    "Scores"= c(22),
                    "Values"=c(3))
#+END_SRC

Then we  will add to df, the data frame df3 as a new row
as follows

#+BEGIN_SRC R :results output :exports both :session
df4  <- rbind(df,df3)
#+END_SRC

#+RESULTS:
: Error in rbind(df, df3) : object 'df3' not found

Another example. We create a (one column) data frame

#+BEGIN_SRC R :results output :exports both :session
df5  <-  data.frame("ID" = c(1:7))
#+END_SRC

#+RESULTS:

Then we can do a column bind of two data frames:

#+BEGIN_SRC R :results output :exports both :session
df6  <-  cbind(df4,df5)
#+END_SRC

#+RESULTS:
: Error in cbind(df4, df5) : object 'df4' not found

** Solution
#+BEGIN_SRC R :results output :exports both :session
library(foreign)  # We Need This Library to read dbf files
df  <- read.dbf("./Datasets/TPer_Vic1.dbf")   ## read the data frame TperVic1.dbf
df$FAC_ELE  <-  as.numeric(as.character(df$FAC_ELE))  # using the hint
tapply(df$FAC_ELE, df$AP4_3_3,sum)     # tapply computes the weighted sum
sum(tapply(df$FAC_ELE, df$AP4_3_3,sum)) # we can do a sum over the results of tapply
## Note that is the same as sum(df$FAC_ELE).
(tapply(df$FAC_ELE, df$AP4_3_3,sum) / sum(df$FAC_ELE)) * 100 # Compute the percentage as the ratio times 100.
#+END_SRC


 In the following we will get our hands into computing some totals, means and ratio estimators for complex surveys. We will use
+ tapply
+ mydesign
+ svytotal
+ svymean 
+ svyratio 
 And we will make use of some of the basic commands we’ve learnt.

First we write in our file.R the preamble, where we call the libraries we will need so don’t forget about loading the packages:
#+begin_src R :results output :exports both :session
library(foreign)  # We need this library to read dbf files
library(survey)  # We need this use the package’s function
df  <- read.dbf("./Datasets/TPer_Vic1.dbf")   ## read the data frame TperVic1.dbf
df$FAC_ELE  <-  as.numeric(as.character(df$FAC_ELE))  # using the hint
#+end_src

We will use the PSU, strata, data set and weights to define the survey design of our data frame and store it into an object called mydesign:

#+begin_src R :results output :exports both :session
mydesign  <- svydesign(ids=~UPM_DIS,strata=~EST_DIS,data=df,weights=~FAC_ELE)
mydesign
#+end_src

To obtain the total estimator we now use the function svytotal:

Note that in addition to the total estimators R also prints the Standard Error.


To obtain the mean estimator we now use the function svymean:

#+begin_src R :results output :exports both :session
svymean(x=~AP4_3_3,mydesign)
#+end_src

Where again we also have the Standard Error.

A Word of Warning.


Note that we obtained a grouped results by values of =AP4_3_3=. This happens only because the values of =AP4_3_3= are not stored as numeric, but as a character (factor) value.
Please discuss this result:

#+begin_src R :results output :exports both :session
df$AP4_3_3  <-  as.numeric(as.character(df$AP4_3_3))
mydesign  <- svydesign(ids=~UPM_DIS,strata=~EST_DIS,data=df,weights=~FAC_ELE)
svytotal(x=~AP4_3_3,mydesign)
#+end_src

There is another function called svyratio, which will allow us to compute different quotients. Just as an illustration we can compute the same as svvymean. Unfortunately svyratio is not good at handling several values, so what I usually do is to define indicator variables:

#+begin_src R :results output :exports both :session
df$Num  <- ifelse(df$AP4_3_3%in%1,1,0) ## Only answer 1 will be counting
df$Den  <- 1   ## All population as denominator
mydesign  <- svydesign(ids=~UPM_DIS,strata=~EST_DIS,data=df,weights=~FAC_ELE) ## update your design
svyratio(numerator=~Num,denominator=~Den,mydesign) 
#+end_src

Now we can also group our results using an additional variable. The
gender of the person answering the interview is stored in the variable
SEXO which has the values 1 for male and 2 for female. Now we can
obtain the estimates group by gender as follows
#+begin_src R :results output :exports both :session
svyby(~Num,by=~SEXO,mydesign,svytotal) 
svyby(~Num,by=~SEXO,mydesign,svymean)  
svyby(~Num,denominator=~Den,by=~SEXO,mydesign,svyratio)
#+end_src

#+RESULTS:
:   SEXO     Num       se
: 1    1 8848874 119701.3
: 2    2 7338350 109648.9
:   SEXO       Num          se
: 1    1 0.2218758 0.002831137
: 2    2 0.1612818 0.002322312
:   SEXO   Num/Den  se.Num/Den
: 1    1 0.2218758 0.002831137
: 2    2 0.1612818 0.002322312

Please note that we are using as denominator the whole population and not only the male population, then the percentages are not expected to add up to 100%

